Revit 2024 API
BuiltInFailures.JoinElementsFailures.CannotJoinRoofError Property
 The roof cannot be joined.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotJoinRoofError { get; }
Visual Basic
Public Shared ReadOnly Property CannotJoinRoofError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotJoinRoofError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.JoinElementsFailures Class
Autodesk.Revit.DB Namespace